Tekla Open API Reference for Tekla Structures 2025
PluginFormBase.AttributesLoadedFromModel Event
 The AttributesLoadedFromModel event is triggered just after the attributes have been loaded from the model into the dialog.
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public event EventHandler AttributesLoadedFromModel
Public Event AttributesLoadedFromModel As EventHandler
Value
Type: System.EventHandler
See Also
Reference
PluginFormBase Class
Tekla.Structures.Dialog Namespace